var app = new Vue({
    el: '#app',
    data: function(){
        return {
            settings:{
                numberOfDices: 4,
                attack: 'normal',
                attackType: 'slash'
            },
            action:null,
            numberOfSixes: 0,
            diceResult:[],
            diceTotal: '00',
            attackHit:0,
            hitTable:{
                slash:{
                    normal:[1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,3,3,3,3,4,4,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,6,6,7,7,7,7,9,9,9,9,11,11,13,13,13,13,13,13,15,15,15,15,8,8,8,8,10,10,10,10,12,12,14,14,14,14,14,14,16,16,16,16,17,17,19,19,21,21,23,23,23,25,18,18,19,19,22,22,24,24,24,26],
                    high:[1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,4,4,4,4,4,4,4,4,4,4,7,7,7,7,7,7,9,9,9,9,9,9,11,11,11,13,13,13,13,13,13,13,13,13,15,15,15,15,15,15,8,8,8,8,8,8,10,10,10,10,10,10,12,12,12,14,14,14,14,14,14,14,14,14,16,16,16,16,16,16],
                    low:[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,6,6,6,6,17,17,17,17,17,17,17,17,19,19,19,19,19,19,19,19,21,21,21,21,21,21,21,21,23,23,23,23,23,23,23,23,23,23,23,23,25,25,25,25,18,18,18,18,18,18,18,18,20,20,20,20,20,20,20,20,22,22,22,22,22,22,22,22,24,24,24,24,24,24,24,24,24,24,24,24,24,26,26,26]
                },
                stab:{
                    normal:[1,1,1,1,2,2,2,2,3,3,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,6,6,7,7,9,9,11,13,13,13,15,15,8,8,10,10,12,14,14,14,16,16,17,17,17,17,19,19,19,19,21,21,21,21,23,23,23,23,23,23,25,25,18,18,18,18,20,20,20,20,22,22,22,22,24,24,24,24,26,26,26,26],
                    high:[1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,3,3,3,3,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,6,6,7,7,7,7,9,9,9,9,11,11,13,13,13,13,13,13,15,15,15,15,8,8,8,8,10,10,10,10,12,12,12,12,14,14,14,14,16,16,16,16],
                    low:[4,4,4,4,4,4,4,4,4,4,5,5,5,5,5,5,5,5,6,6,7,7,9,9,11,13,13,13,15,15,8,8,10,10,12,12,14,16,16,16,17,17,17,17,17,17,19,19,19,19,19,19,21,21,21,21,21,21,23,23,23,23,23,23,23,23,23,25,25,25,18,18,18,18,18,18,20,20,20,20,20,20,22,22,22,22,22,22,24,24,24,24,24,24,24,24,24,26,26,26]
                }
            },
            bodyParts:{
                1:'Ansikte',
                2:'Skalle',
                3:'Hals',
                4:'Bröstkorg',
                5:'Mage',
                6:'Underliv',
                7:'v. Skuldra',
                8:'h. Skuldra',
                9:'v. Överarm',
                10:'h. Överarm',
                11:'v. Armbåge',
                12:'h. Armbåge',
                13:'v. Underarm',
                14:'h. Underarm',
                15:'v. Hand',
                16:'h. Hand',
                17:'v. Höft',
                18:'h. Höft',
                19:'v. Lår',
                20:'h. Lår',
                21:'v. Knä',
                22:'h. Knä',
                23:'v. Vad',
                24:'h. Vad',
                25:'v. Fot',
                26:'h. Fot'
            }
        }
    },
    methods:{
        roll: function(){
            this.action = 'dice';
            this.diceResult = [];
            this.numberOfSixes=0;
            this.diceTotal = 0;

            var rerollDices = 0;
            var diceToRoll = this.settings.numberOfDices;

            do{
                rerollDices = 0;
                var dices = [];

                for(var i=0; i < diceToRoll; i++){
                    var d = Math.floor((Math.random() * 6) + 1);
                    if(d == 6){
                        rerollDices++;
                        this.numberOfSixes++;
                    }else{
                        this.diceTotal += d;
                    }
                    dices.push(d);
                }
                this.diceResult.push(dices);

                diceToRoll = rerollDices * 2;
            }while(rerollDices != 0);
        },
        rollAttack: function(){
            this.action = 'attack';
            this.diceResult = [];
            var d = Math.floor((Math.random() * 100));
            this.attackHit = this.hitTable[this.settings.attackType][this.settings.attack][d];
            this.diceTotal = this.bodyParts[this.attackHit];
        }
    }
  })